# << 우선순위 큐 >>

# 우선순위 큐는 데이터를 추가한 순서대로 제거하는 선입선출(FIFO) 특성을 가진 
# 일반적인 큐의 자료구조와 달리, 데이터 추가는 어떤 순서로 해도 상관이 없지만, 
# 제거될 때는 가장 작은 값을 제거하는 독특한 특성을 지닌 자료구조입니다. 
# 이 말은 내부적으로 데이터를 정렬된 상태로 보관하는 메커니즘이 있다는 뜻이고, 
# 좀 더 구체적으로 얘기하면 heapq 모듈을 통해 구현되어 있습니다.

# 1. from queue import PriorityQueue 클래스 임포트 
# 2. que = PriorityQueue() 생성자 
# 3. put() 원소 추가 메소드 
# 4. get() 원소 삭제 메소드 
# 5. 만약 단순 오름차순이 아닌 다른 기준으로 원소가 정렬되기를 원한다면, (우선순위, 값)의 튜플의 형태로 데이터를 추가하고 제거하면 됩니다.
# 6. 내부적으로 heap 모듈을 사용하는 PriorityQueue 클래스의 put(), get() 함수는 O(log n)의 시간 복잡도를 가집니다.

